In [1]:
import numpy as np
import pandas as pd

In [2]:
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [3]:
df

                   A         B         C         D
2013-01-01 -1.281372  0.251823 -0.180292  0.403019
2013-01-02  1.094138  2.910218 -0.817546 -1.312211
2013-01-03 -0.118667 -0.323213  0.197315  0.723925
2013-01-04 -0.291653  1.074747  1.030795 -0.702809
2013-01-05  0.925589 -0.143491  0.005801 -0.731115
2013-01-06 -0.118211 -0.945960  0.154150  0.217833

In [4]:
df.iloc[3]

A   -0.291653
B    1.074747
C    1.030795
D   -0.702809
Name: 2013-01-04 00:00:00, dtype: float64

In [5]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.291653  1.074747
2013-01-05  0.925589 -0.143491

In [6]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  1.094138 -0.817546
2013-01-03 -0.118667  0.197315
2013-01-05  0.925589  0.005801

In [7]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  1.094138  2.910218 -0.817546 -1.312211
2013-01-03 -0.118667 -0.323213  0.197315  0.723925

In [8]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.251823 -0.180292
2013-01-02  2.910218 -0.817546
2013-01-03 -0.323213  0.197315
2013-01-04  1.074747  1.030795
2013-01-05 -0.143491  0.005801
2013-01-06 -0.945960  0.154150

In [9]:
df.iloc[1, 1]

2.910217628113816

In [10]:
df.iat[1, 1]

2.910217628113816